## Pandas

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\varun sirpal\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in c:\users\varun sirpal\anaconda3\lib\site-packages (from pandas) (1.16.2)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\varun sirpal\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: pytz>=2011k in c:\users\varun sirpal\anaconda3\lib\site-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in c:\users\varun sirpal\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [2]:
import numpy as np
import pandas as pd

In [6]:
user_data = {
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5)
}

In [8]:
user_data

{'MarksA': array([46, 35, 33, 22, 11]),
 'MarksB': array([50, 60, 63, 74, 57]),
 'MarksC': array([93, 84, 97,  2, 14])}

In [13]:
df = pd.DataFrame(user_data,dtype='float32')
print(df)

   MarksA  MarksB  MarksC
0    46.0    50.0    93.0
1    35.0    60.0    84.0
2    33.0    63.0    97.0
3    22.0    74.0     2.0
4    11.0    57.0    14.0

In [12]:
df.head(n=3)

   MarksA  MarksB  MarksC
0      46      50      93
1      35      60      84
2      33      63      97

In [14]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [15]:
df.to_csv("marks.csv")

In [17]:
my_data = pd.read_csv("marks.csv")
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0    46.0    50.0    93.0
1           1    35.0    60.0    84.0
2           2    33.0    63.0    97.0
3           3    22.0    74.0     2.0
4           4    11.0    57.0    14.0

In [19]:
my_data = my_data.drop(columns=['Unnamed: 0'])
my_data

   MarksA  MarksB  MarksC
0    46.0    50.0    93.0
1    35.0    60.0    84.0
2    33.0    63.0    97.0
3    22.0    74.0     2.0
4    11.0    57.0    14.0

In [20]:
my_data.describe()

          MarksA    MarksB    MarksC
count   5.000000   5.00000   5.00000
mean   29.400000  60.80000  58.00000
std    13.352902   8.81476  46.08145
min    11.000000  50.00000   2.00000
25%    22.000000  57.00000  14.00000
50%    33.000000  60.00000  84.00000
75%    35.000000  63.00000  93.00000
max    46.000000  74.00000  97.00000

In [21]:
df.iloc[3]

MarksA    22.0
MarksB    74.0
MarksC     2.0
Name: 3, dtype: float32

In [22]:
df.iloc[3,1]

74.0

In [25]:
idx = df.columns.get_loc('MarksB')
df.iloc[3,idx]

74.0

In [26]:
df.iloc[:3,[1,2]]

   MarksB  MarksC
0    50.0    93.0
1    60.0    84.0
2    63.0    97.0

In [27]:
 my_data.sort_values(by=["MarksA"],ascending=True)

   MarksA  MarksB  MarksC
4    11.0    57.0    14.0
3    22.0    74.0     2.0
2    33.0    63.0    97.0
1    35.0    60.0    84.0
0    46.0    50.0    93.0